_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
dense_13 (Dense)             (None, 43)                172       
_________________________________________________________________
dense_14 (Dense)             (None, 28)                1232      
_________________________________________________________________
dense_15 (Dense)             (None, 1)                 29        
=================================================================
Total params: 1,433
Trainable params: 1,433
Non-trainable params: 0
_________________________________________________________________
